[
  {
    "id": 1,
    "title": "Nineteen Eighty-Four",
    "author": "George Orwell",
    "numberOfPages": 328,
    "description": "A dystopian novel exploring surveillance, totalitarianism, and the erosion of truth in a society ruled by an omnipresent authoritarian regime."
  },
  {
    "id": 2,
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "numberOfPages": 279,
    "description": "A classic romantic novel that examines social class, marriage, and personal growth through sharp wit and memorable characters."
  },
  {
    "id": 3,
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "numberOfPages": 498,
    "description": "A sweeping history of humankind that connects biology, anthropology, and history to explain how societies evolved."
  },
  {
    "id": 4,
    "title": "Dune",
    "author": "Frank Herbert",
    "numberOfPages": 412,
    "description": "An epic science fiction story about politics, religion, ecology, and power struggles on a desert planet called Arrakis."
  },
  {
    "id": 5,
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "numberOfPages": 423,
    "description": "A fantasy adventure following a reluctant hero who embarks on a journey that shapes the fate of an entire world."
  },
  {
    "id": 6,
    "title": "One Hundred Years of Solitude",
    "author": "Gabriel García Márquez",
    "numberOfPages": 417,
    "description": "A magical realism masterpiece chronicling generations of a family, blending myth, memory, and history."
  },
  {
    "id": 7,
    "title": "Meditations",
    "author": "Marcus Aurelius",
    "numberOfPages": 256,
    "description": "A collection of personal philosophical reflections on stoicism, duty, self-discipline, and the nature of life."
  },
  {
    "id": 8,
    "title": "Foundation",
    "author": "Isaac Asimov",
    "numberOfPages": 244,
    "description": "A foundational science fiction novel exploring the rise and fall of civilizations through mathematics and prediction."
  },
  {
    "id": 9,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "numberOfPages": 336,
    "description": "A powerful story about justice, race, and moral growth seen through the eyes of a child in the American South."
  },
  {
    "id": 10,
    "title": "The Shining",
    "author": "Stephen King",
    "numberOfPages": 497,
    "description": "A psychological horror novel that delves into isolation, madness, and the supernatural within a haunted hotel."
  },
  {
    "id": 11,
    "title": "The Stranger",
    "author": "Albert Camus",
    "numberOfPages": 159,
    "description": "A philosophical novel exploring absurdism, existentialism, and the emotional detachment of its protagonist."
  },
  {
    "id": 12,
    "title": "Outliers",
    "author": "Malcolm Gladwell",
    "numberOfPages": 336,
    "description": "An exploration of human behavior, decision-making, and the hidden patterns that shape success and failure."
  },
  {
    "id": 13,
    "title": "The Hitchhiker’s Guide to the Galaxy",
    "author": "Douglas Adams",
    "numberOfPages": 224,
    "description": "A humorous science fiction adventure blending absurdity, satire, and cosmic travel across the universe."
  },
  {
    "id": 14,
    "title": "Frankenstein",
    "author": "Mary Shelley",
    "numberOfPages": 280,
    "description": "A gothic novel that examines creation, responsibility, and humanity through a tragic scientific experiment."
  },
  {
    "id": 15,
    "title": "The Art of War",
    "author": "Sun Tzu",
    "numberOfPages": 112,
    "description": "A concise military strategy treatise offering timeless insights into leadership, planning, and conflict."
  },
  {
    "id": 16,
    "title": "The Kite Runner",
    "author": "Khaled Hosseini",
    "numberOfPages": 371,
    "description": "An emotional novel about friendship, guilt, and redemption set against decades of political turmoil."
  },
  {
    "id": 17,
    "title": "American Gods",
    "author": "Neil Gaiman",
    "numberOfPages": 465,
    "description": "A modern fantasy weaving mythology, gods, and contemporary America into a richly imaginative narrative."
  },
  {
    "id": 18,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "numberOfPages": 180,
    "description": "A tragic tale of ambition, wealth, and illusion during the Jazz Age, centered on the American Dream."
  },
  {
    "id": 19,
    "title": "The Demon-Haunted World",
    "author": "Carl Sagan",
    "numberOfPages": 384,
    "description": "A science-focused book encouraging critical thinking, skepticism, and curiosity about the universe."
  },
  {
    "id": 20,
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "numberOfPages": 208,
    "description": "A philosophical novel about self-discovery, destiny, and following one’s personal legend."
  },
  {
    "id": 21,
    "title": "The Witcher: The Last Wish",
    "author": "Andrzej Sapkowski",
    "numberOfPages": 288,
    "description": "A collection of short stories introducing Geralt of Rivia, a professional monster hunter known as a witcher. The book explores moral ambiguity, destiny, and the cost of neutrality in a world where humans, monsters, and magic coexist. Each story presents a self-contained adventure while slowly building the foundation of Geralt's character and the Witcher universe."
  },
  {
    "id": 22,
    "title": "The Witcher: Sword of Destiny",
    "author": "Andrzej Sapkowski",
    "numberOfPages": 384,
    "description": "Continuing Geralt’s journey, this collection of interconnected short stories deepens the themes of fate, choice, and humanity. The book introduces key characters such as Ciri and Yennefer in greater depth, showing how destiny binds lives together. It serves as a bridge between the episodic stories and the main Witcher saga."
  },
  {
    "id": 23,
    "title": "The Witcher: Blood of Elves",
    "author": "Andrzej Sapkowski",
    "numberOfPages": 320,
    "description": "The first novel of the Witcher saga proper, focusing on Geralt’s role as guardian and mentor to Ciri, a child of prophecy. Political intrigue, racial tensions, and the looming threat of war shape the world around them. The story shifts from isolated adventures to a broader, interconnected narrative about power, destiny, and survival."
  }
]
